Schedules can only be placed on Sheets.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SchedulesCanBePlacedOnSheetsOnly { get; }
  Visual Basic
Public Shared ReadOnly Property SchedulesCanBePlacedOnSheetsOnly As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SchedulesCanBePlacedOnSheetsOnly {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ScheduleViewFailures Class
  Autodesk.Revit.DB Namespace